# 아파트 실거래가 예측 - https://bit.ly/3v5edhJ

### 부동산 빅데이터와 AI를 이용하여 실거래가를 예측 분석 | 회귀 | RMSE

In [1]:
import pandas as pd

In [2]:
train_df = pd.read_csv('./data/train.csv')
test_df = pd.read_csv('./data/test.csv')
print(train_df.shape)
train_df.head()

(1216553, 13)

,transaction_id,apartment_id,city,dong,jibun,apt,addr_kr,exclusive_use_area,year_of_completion,transaction_year_month,transaction_date,floor,transaction_real_price
0,0,7622,서울특별시,신교동,6-13,신현(101동),신교동 6-13 신현(101동),84.82,2002,200801,21~31,2,37500
1,1,5399,서울특별시,필운동,142,사직파크맨션,필운동 142 사직파크맨션,99.17,1973,200801,1~10,6,20000
2,2,3578,서울특별시,필운동,174-1,두레엘리시안,필운동 174-1 두레엘리시안,84.74,2007,200801,1~10,6,38500
3,3,10957,서울특별시,내수동,95,파크팰리스,내수동 95 파크팰리스,146.39,2003,200801,11~20,15,118000
4,4,10639,서울특별시,내수동,110-15,킹스매너,내수동 110-15 킹스매너,194.43,2004,200801,21~31,3,120000

In [3]:
# 데이터 줄이기

train_df = train_df.loc[train_df["transaction_id"]%50==0, :]
train_df = train_df.reset_index(drop=True)
train_df.head()

,transaction_id,apartment_id,city,dong,jibun,apt,addr_kr,exclusive_use_area,year_of_completion,transaction_year_month,transaction_date,floor,transaction_real_price
0,0,7622,서울특별시,신교동,6-13,신현(101동),신교동 6-13 신현(101동),84.82,2002,200801,21~31,2,37500
1,50,12536,서울특별시,인의동,48-2,효성쥬얼리시티,인의동 48-2 효성쥬얼리시티,106.81,2006,200802,11~20,13,64000
2,100,3926,서울특별시,수송동,85,로얄팰리스스위트,수송동 85 로얄팰리스스위트,40.07,2005,200803,11~20,10,19000
3,150,7094,서울특별시,숭인동,569-3,숭인동 105동 (569-3),숭인동 569-3 숭인동 105동 (569-3),59.74,2000,200803,21~31,2,18000
4,200,10147,서울특별시,창신동,703,창신쌍용2,창신동 703 창신쌍용2,106.62,1993,200804,11~20,5,43500

In [4]:
print(test_df.shape)
test_df.head()

(5463, 12)

,transaction_id,apartment_id,city,dong,jibun,apt,addr_kr,exclusive_use_area,year_of_completion,transaction_year_month,transaction_date,floor
0,1145756,10453,서울특별시,목동,938,청학,목동 938 청학,35.5500,2002,201711,11~20,2
1,1198704,989,부산광역시,초량동,1143-8,고관맨션,초량동 1143-8 고관맨션,68.7200,1977,201708,21~31,2
2,1222384,8597,부산광역시,괴정동,447-13,우림그린,괴정동 447-13 우림그린,72.5400,1989,201710,11~20,2
3,1179897,11086,서울특별시,대치동,1007-2,풍림아이원4차(1007-2),대치동 1007-2 풍림아이원4차(1007-2),111.5400,2004,201707,1~10,10
4,1223091,2121,부산광역시,다대동,1670,다대롯데캐슬블루,다대동 1670 다대롯데캐슬블루,119.6398,2014,201712,11~20,21

In [5]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24320 entries, 0 to 24319
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   transaction_id          24320 non-null  int64
 1   apartment_id            24320 non-null  int64
 2   city                    24320 non-null  object
 3   dong                    24320 non-null  object
 4   jibun                   24320 non-null  object
 5   apt                     24320 non-null  object
 6   addr_kr                 24320 non-null  object
 7   exclusive_use_area      24320 non-null  float64
 8   year_of_completion      24320 non-null  int64
 9   transaction_year_month  24320 non-null  int64
 10  transaction_date        24320 non-null  object
 11  floor                   24320 non-null  int64
 12  transaction_real_price  24320 non-null  int64
dtypes: float64(1), int64(6), object(6)
memory usage: 2.4+ MB

In [6]:
test_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5463 entries, 0 to 5462
Data columns (total 12 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   transaction_id          5463 non-null   int64
 1   apartment_id            5463 non-null   int64
 2   city                    5463 non-null   object
 3   dong                    5463 non-null   object
 4   jibun                   5463 non-null   object
 5   apt                     5463 non-null   object
 6   addr_kr                 5463 non-null   object
 7   exclusive_use_area      5463 non-null   float64
 8   year_of_completion      5463 non-null   int64
 9   transaction_year_month  5463 non-null   int64
 10  transaction_date        5463 non-null   object
 11  floor                   5463 non-null   int64
dtypes: float64(1), int64(5), object(6)
memory usage: 512.3+ KB

## city

In [7]:
train_df["city"].unique()

array(['서울특별시', '부산광역시'], dtype=object)

In [8]:
test_df["city"].unique()

array(['서울특별시', '부산광역시'], dtype=object)

### Labeling

In [9]:
train_df.loc[train_df["city"] == "서울특별시", "city"] = 0
train_df.loc[train_df["city"] == "부산광역시", "city"] = 1
train_df["city"] = train_df["city"].astype('int')

test_df.loc[test_df["city"] == "서울특별시", "city"] = 0
test_df.loc[test_df["city"] == "부산광역시", "city"] = 1
test_df["city"] = test_df["city"].astype('int')

In [10]:
train_df.head()

,transaction_id,apartment_id,city,dong,jibun,apt,addr_kr,exclusive_use_area,year_of_completion,transaction_year_month,transaction_date,floor,transaction_real_price
0,0,7622,0,신교동,6-13,신현(101동),신교동 6-13 신현(101동),84.82,2002,200801,21~31,2,37500
1,50,12536,0,인의동,48-2,효성쥬얼리시티,인의동 48-2 효성쥬얼리시티,106.81,2006,200802,11~20,13,64000
2,100,3926,0,수송동,85,로얄팰리스스위트,수송동 85 로얄팰리스스위트,40.07,2005,200803,11~20,10,19000
3,150,7094,0,숭인동,569-3,숭인동 105동 (569-3),숭인동 569-3 숭인동 105동 (569-3),59.74,2000,200803,21~31,2,18000
4,200,10147,0,창신동,703,창신쌍용2,창신동 703 창신쌍용2,106.62,1993,200804,11~20,5,43500

In [11]:
test_df.head()

,transaction_id,apartment_id,city,dong,jibun,apt,addr_kr,exclusive_use_area,year_of_completion,transaction_year_month,transaction_date,floor
0,1145756,10453,0,목동,938,청학,목동 938 청학,35.5500,2002,201711,11~20,2
1,1198704,989,1,초량동,1143-8,고관맨션,초량동 1143-8 고관맨션,68.7200,1977,201708,21~31,2
2,1222384,8597,1,괴정동,447-13,우림그린,괴정동 447-13 우림그린,72.5400,1989,201710,11~20,2
3,1179897,11086,0,대치동,1007-2,풍림아이원4차(1007-2),대치동 1007-2 풍림아이원4차(1007-2),111.5400,2004,201707,1~10,10
4,1223091,2121,1,다대동,1670,다대롯데캐슬블루,다대동 1670 다대롯데캐슬블루,119.6398,2014,201712,11~20,21

## drop addr_kr

In [12]:
train_df.drop('addr_kr', axis=1, inplace=True)
test_df.drop('addr_kr', axis=1, inplace=True)

## 한강이 보이는 동네

In [13]:
hanriver_dong = ['성수동1가','삼성동','이촌동','공덕동','서교동','한강로3가','목동','고덕동', '암사동', '천호동', '풍납동',
                '잠실동', '청담동', '압구정동', '신사동', '잠원동', '반포동', '흑석동', '노량진동', '여의동', '당산동',
                '양평동', '염창동', '가양동', '방화동']

# isin을 사용해서 한강이 보이는 동네는 1, 아니면 0
# True, False를 integer로 변환

train_df['hanriver']=train_df['dong'].isin(hanriver_dong).astype(int)
test_df['hanriver']=test_df['dong'].isin(hanriver_dong).astype(int)

## 평균 실거래가로 동네 sorting

In [14]:
# "dong"으로 groupby 후, 평균값으로 집계
# 실거래가를 기준으로 오름차순 정렬 후 reset_index()
dong = train_df[['transaction_real_price','dong']].groupby('dong').mean().sort_values('transaction_real_price').reset_index()

# dong의 인덱스를 idx 컬럼에 추가
dong["idx"] = dong.index
dong

        dong  transaction_real_price  idx
0      봉래동5가             4616.666667    0
1      신선동2가             5300.000000    1
2    일광면 삼성리             7740.000000    2
3      보수동2가             7745.000000    3
4        영주동             9707.142857    4
..       ...                     ...  ...
403      한남동           125081.578947  403
404      반포동           131895.318471  404
405    회현동2가           148920.000000  405
406    용산동5가           157250.000000  406
407     압구정동           163753.676471  407

[408 rows x 3 columns]

In [15]:
# dong_rank에 동 이름을 key, 순서를 value
dong_rank = {}
for i in range(len(dong)):
    dong_rank[dong["dong"].iloc[i]] = dong["idx"].iloc[i]
dong_rank

{'봉래동5가': 0,
 '신선동2가': 1,
 '일광면 삼성리': 2,
 '보수동2가': 3,
 '영주동': 4,
 '대청동1가': 5,
 '동광동5가': 6,
 '토성동2가': 7,
 '기장읍 서부리': 8,
 '금사동': 9,
 '반송동': 10,
 '수정동': 11,
 '감만동': 12,
 '동삼동': 13,
 '영등포동3가': 14,
 '봉래동4가': 15,
 '대청동4가': 16,
 '미근동': 17,
 '구평동': 18,
 '영등포동2가': 19,
 '아미동2가': 20,
 '덕천동': 21,
 '일광면 이천리': 22,
 '학장동': 23,
 '동대신동3가': 24,
 '장림동': 25,
 '기장읍 청강리': 26,
 '서동': 27,
 '명장동': 28,
 '부용동1가': 29,
 '모라동': 30,
 '기장읍 대라리': 31,
 '덕포동': 32,
 '대창동1가': 33,
 '기장읍 동부리': 34,
 '영선동3가': 35,
 '기장읍 대변리': 36,
 '삼선동5가': 37,
 '보수동1가': 38,
 '금곡동': 39,
 '전포동': 40,
 '감천동': 41,
 '남산동': 42,
 '초량동': 43,
 '남항동3가': 44,
 '신평동': 45,
 '당감동': 46,
 '다대동': 47,
 '동대신동1가': 48,
 '우암동': 49,
 '삼락동': 50,
 '토성동5가': 51,
 '괴정동': 52,
 '구포동': 53,
 '만덕동': 54,
 '개금동': 55,
 '장안읍 좌천리': 56,
 '좌천동': 57,
 '주례동': 58,
 '서대신동1가': 59,
 '기장읍 교리': 60,
 '봉래동1가': 61,
 '정관읍 달산리': 62,
 '서대신동2가': 63,
 '흥인동': 64,
 '당리동': 65,
 '회동동': 66,
 '엄궁동': 67,
 '지사동': 68,
 '범천동': 69,
 '수안동': 70,
 '청학동': 71,
 '가야동': 72,
 '하단동': 73,
 '남부민동': 74,
 '광안동': 75,
 '정관읍 방곡리': 76,
 '신창동1가': 77,
 '부민동1가': 78,
 '초읍동': 79,
 '대조동': 80,
 '암남동': 81,
 '남항동2가': 82,
 '남항동1가': 83,
 '범전동': 84,
 '영선동4가': 85,
 '청룡동': 86,
 '문현동': 87,
 '용당동': 88,
 '영선동2가': 89,
 '영등포동1가': 90,
 '반여동': 91,
 '대평동1가': 92,
 '노고산동': 93,
 '대연동': 94,
 '신호동': 95,
 '충무동2가': 96,
 '부민동3가': 97,
 '재송동': 98,
 '괘법동': 99,
 '부곡동': 100,
 '익선동': 101,
 '서대신동3가': 102,
 '연산동': 103,
 '낙민동': 104,
 '영선동1가': 105,
 '망미동': 106,
 '복천동': 107,
 '기장읍 내리': 108,
 '부평동4가': 109,
 '부전동': 110,
 '양정동': 111,
 '정관읍 매학리': 112,
 '화명동': 113,
 '안락동': 114,
 '철마면 고촌리': 115,
 '홍익동': 116,
 '동대신동2가': 117,
 '부암동': 118,
 '송정동': 119,
 '좌동': 120,
 '온천동': 121,
 '화양동': 122,
 '신영동': 123,
 '구서동': 124,
 '가리봉동': 125,
 '예장동': 126,
 '연지동': 127,
 '토성동1가': 128,
 '쌍문동': 129,
 '사직동': 130,
 '감전동': 131,
 '수송동': 132,
 '정관읍 모전리': 133,
 '갈현동': 134,
 '상계동': 135,
 '동소문동4가': 136,
 '동선동4가': 137,
 '정관읍 용수리': 138,
 '역촌동': 139,
 '중곡동': 140,
 '범일동': 141,
 '구산동': 142,
 '시흥동': 143,
 '독산동': 144,
 '수유동': 145,
 '방학동': 146,
 '번동': 147,
 '수영동': 148,
 '신월동': 149,
 '창천동': 150,
 '거제동': 151,
 '장전동': 152,
 '월계동': 153,
 '오류동': 154,
 '도봉동': 155,
 '당산동2가': 156,
 '안암동3가': 157,
 '신내동': 158,
 '상도1동': 159,
 '용호동': 160,
 '창동': 161,
 '구로동': 162,
 '회기동': 163,
 '중화동': 164,
 '방화동': 165,
 '가산동': 166,
 '봉래동2가': 167,
 '면목동': 168,
 '공릉동': 169,
 '망우동': 170,
 '상월곡동': 171,
 '녹번동': 172,
 '사근동': 173,
 '숭인동': 174,
 '충정로3가': 175,
 '우이동': 176,
 '양평동2가': 177,
 '고척동': 178,
 '양평동1가': 179,
 '수색동': 180,
 '삼선동4가': 181,
 '명지동': 182,
 '신사동': 183,
 '정릉동': 184,
 '중계동': 185,
 '중동': 186,
 '하계동': 187,
 '신림동': 188,
 '항동': 189,
 '교북동': 190,
 '영등포동7가': 191,
 '보문동6가': 192,
 '충무동1가': 193,
 '묵동': 194,
 '응암동': 195,
 '궁동': 196,
 '대교동2가': 197,
 '민락동': 198,
 '신길동': 199,
 '가양동': 200,
 '증산동': 201,
 '개봉동': 202,
 '남천동': 203,
 '홍제동': 204,
 '문래동6가': 205,
 '창신동': 206,
 '천호동': 207,
 '길동': 208,
 '문래동5가': 209,
 '휘경동': 210,
 '상봉동': 211,
 '홍은동': 212,
 '명륜동': 213,
 '충정로2가': 214,
 '양평동6가': 215,
 '대림동': 216,
 '공항동': 217,
 '용답동': 218,
 '장위동': 219,
 '석관동': 220,
 '도림동': 221,
 '신설동': 222,
 '등촌동': 223,
 '미아동': 224,
 '이문동': 225,
 '산림동': 226,
 '성내동': 227,
 '천왕동': 228,
 '답십리동': 229,
 '양평동3가': 230,
 '돈암동': 231,
 '거여동': 232,
 '신교동': 233,
 '마포동': 234,
 '전농동': 235,
 '봉천동': 236,
 '안암동1가': 237,
 '장안동': 238,
 '천연동': 239,
 '양평동5가': 240,
 '문래동4가': 241,
 '대현동': 242,
 '청량리동': 243,
 '삼선동2가': 244,
 '연희동': 245,
 '온수동': 246,
 '제기동': 247,
 '불광동': 248,
 '종암동': 249,
 '하월곡동': 250,
 '양평동4가': 251,
 '구기동': 252,
 '망원동': 253,
 '성산동': 254,
 '용두동': 255,
 '염창동': 256,
 '강일동': 257,
 '용문동': 258,
 '마장동': 259,
 '노량진동': 260,
 '연남동': 261,
 '당산동1가': 262,
 '마천동': 263,
 '남현동': 264,
 '화곡동': 265,
 '동소문동7가': 266,
 '내발산동': 267,
 '삼전동': 268,
 '신창동': 269,
 '길음동': 270,
 '명륜1가': 271,
 '영등포동': 272,
 '산천동': 273,
 '북가좌동': 274,
 '보문동3가': 275,
 '현저동': 276,
 '효창동': 277,
 '도선동': 278,
 '염리동': 279,
 '냉천동': 280,
 '당산동3가': 281,
 '금호동3가': 282,
 '우동': 283,
 '풍납동': 284,
 '북아현동': 285,
 '남가좌동': 286,
 '신도림동': 287,
 '사당동': 288,
 '영천동': 289,
 '명일동': 290,
 '대방동': 291,
 '응봉동': 292,
 '용산동2가': 293,
 '남산동2가': 294,
 '신수동': 295,
 '합동': 296,
 '하왕십리동': 297,
 '신당동': 298,
 '토정동': 299,
 '석촌동': 300,
 '금호동1가': 301,
 '후암동': 302,
 '도화동': 303,
 '당산동': 304,
 '마곡동': 305,
 '행당동': 306,
 '오금동': 307,
 '황학동': 308,
 '상일동': 309,
 '동선동1가': 310,
 '신대방동': 311,
 '당산동4가': 312,
 '암사동': 313,
 '신정동': 314,
 '군자동': 315,
 '창전동': 316,
 '진관동': 317,
 '수서동': 318,
 '본동': 319,
 '용강동': 320,
 '인의동': 321,
 '가락동': 322,
 '동소문동5가': 323,
 '양재동': 324,
 '구의동': 325,
 '삼선동3가': 326,
 '상도동': 327,
 '도원동': 328,
 '영등포동8가': 329,
 '만리동1가': 330,
 '명륜2가': 331,
 '문배동': 332,
 '원효로4가': 333,
 '순화동': 334,
 '논현동': 335,
 '고덕동': 336,
 '무악동': 337,
 '대흥동': 338,
 '금호동4가': 339,
 '청운동': 340,
 '신공덕동': 341,
 '자양동': 342,
 '상암동': 343,
 '성수동2가': 344,
 '장지동': 345,
 '아현동': 346,
 '둔촌동': 347,
 '공덕동': 348,
 '현석동': 349,
 '당산동5가': 350,
 '금호동2가': 351,
 '보광동': 352,
 '문래동3가': 353,
 '흑석동': 354,
 '중림동': 355,
 '자곡동': 356,
 '합정동': 357,
 '송파동': 358,
 '목동': 359,
 '옥수동': 360,
 '우면동': 361,
 '광장동': 362,
 '문정동': 363,
 '역삼동': 364,
 '세곡동': 365,
 '성수동1가': 366,
 '동작동': 367,
 '율현동': 368,
 '상수동': 369,
 '대교동1가': 370,
 '신원동': 371,
 '개포동': 372,
 '충무로4가': 373,
 '방이동': 374,
 '동자동': 375,
 '일원동': 376,
 '회현동1가': 377,
 '이태원동': 378,
 '서초동': 379,
 '한강로2가': 380,
 '평창동': 381,
 '원효로1가': 382,
 '방배동': 383,
 '상왕십리동': 384,
 '신천동': 385,
 '잠원동': 386,
 '내곡동': 387,
 '신계동': 388,
 '서교동': 389,
 '여의도동': 390,
 '동빙고동': 391,
 '한강로3가': 392,
 '청담동': 393,
 '이촌동': 394,
 '한강로1가': 395,
 '삼성동': 396,
 '잠실동': 397,
 '내수동': 398,
 '하중동': 399,
 '도곡동': 400,
 '대치동': 401,
 '서빙고동': 402,
 '한남동': 403,
 '반포동': 404,
 '회현동2가': 405,
 '용산동5가': 406,
 '압구정동': 407}

In [16]:
# df의 dong_rank에 위 dong_rank 딕셔너리 매핑
train_df["dong_rank"] = train_df["dong"].map(dong_rank)
test_df["dong_rank"] = test_df["dong"].map(dong_rank)

# dong 컬럼 drop
train_df.drop("dong", axis=1, inplace=True)
test_df.drop("dong", axis=1, inplace=True)

train_df.head()

,transaction_id,apartment_id,city,jibun,apt,exclusive_use_area,year_of_completion,transaction_year_month,transaction_date,floor,transaction_real_price,hanriver,dong_rank
0,0,7622,0,6-13,신현(101동),84.82,2002,200801,21~31,2,37500,0,233
1,50,12536,0,48-2,효성쥬얼리시티,106.81,2006,200802,11~20,13,64000,0,321
2,100,3926,0,85,로얄팰리스스위트,40.07,2005,200803,11~20,10,19000,0,132
3,150,7094,0,569-3,숭인동 105동 (569-3),59.74,2000,200803,21~31,2,18000,0,174
4,200,10147,0,703,창신쌍용2,106.62,1993,200804,11~20,5,43500,0,206

## 평균 실거래가로 아파트 sorting

In [17]:
apt = train_df[['transaction_real_price','apt']].groupby('apt').mean().sort_values('transaction_real_price').reset_index()
apt["idx"] = apt.index


apt_rank = {}
for i in range(len(apt)):
    apt_rank[apt["apt"].iloc[i]] = apt["idx"].iloc[i]

train_df["apt_rank"] = train_df["apt"].map(apt_rank)
test_df["apt_rank"] = test_df["apt"].map(apt_rank)

train_df.drop("apt", axis=1, inplace=True)
test_df.drop("apt", axis=1, inplace=True)

train_df.head()

,transaction_id,apartment_id,city,jibun,exclusive_use_area,year_of_completion,transaction_year_month,transaction_date,floor,transaction_real_price,hanriver,dong_rank,apt_rank
0,0,7622,0,6-13,84.82,2002,200801,21~31,2,37500,0,233,3156
1,50,12536,0,48-2,106.81,2006,200802,11~20,13,64000,0,321,3935
2,100,3926,0,85,40.07,2005,200803,11~20,10,19000,0,132,2066
3,150,7094,0,569-3,59.74,2000,200803,21~31,2,18000,0,174,1227
4,200,10147,0,703,106.62,1993,200804,11~20,5,43500,0,206,2731

## 평균 실거래가로 지번 sorting

In [18]:
jibun = train_df[['transaction_real_price','jibun']].groupby('jibun').mean().sort_values('transaction_real_price').reset_index()
jibun["idx"] = jibun.index


jibun_rank = {}
for i in range(len(jibun)):
    jibun_rank[jibun["jibun"].iloc[i]] = jibun["idx"].iloc[i]

train_df["jibun_rank"] = train_df["jibun"].map(jibun_rank)
test_df["jibun_rank"] = test_df["jibun"].map(jibun_rank)

train_df.drop("jibun", axis=1, inplace=True)
test_df.drop("jibun", axis=1, inplace=True)

train_df.head()

,transaction_id,apartment_id,city,exclusive_use_area,year_of_completion,transaction_year_month,transaction_date,floor,transaction_real_price,hanriver,dong_rank,apt_rank,jibun_rank
0,0,7622,0,84.82,2002,200801,21~31,2,37500,0,233,3156,2335
1,50,12536,0,106.81,2006,200802,11~20,13,64000,0,321,3935,3315
2,100,3926,0,40.07,2005,200803,11~20,10,19000,0,132,2066,1182
3,150,7094,0,59.74,2000,200803,21~31,2,18000,0,174,1227,1111
4,200,10147,0,106.62,1993,200804,11~20,5,43500,0,206,2731,2469

In [19]:
train_df.head()

,transaction_id,apartment_id,city,exclusive_use_area,year_of_completion,transaction_year_month,transaction_date,floor,transaction_real_price,hanriver,dong_rank,apt_rank,jibun_rank
0,0,7622,0,84.82,2002,200801,21~31,2,37500,0,233,3156,2335
1,50,12536,0,106.81,2006,200802,11~20,13,64000,0,321,3935,3315
2,100,3926,0,40.07,2005,200803,11~20,10,19000,0,132,2066,1182
3,150,7094,0,59.74,2000,200803,21~31,2,18000,0,174,1227,1111
4,200,10147,0,106.62,1993,200804,11~20,5,43500,0,206,2731,2469

## 거래 날짜 Labeling

In [20]:
train_df['transaction_date'].unique(), test_df['transaction_date'].unique()

(array(['21~31', '11~20', '1~10', '21~30', '21~28', '21~29'], dtype=object),
 array(['11~20', '21~31', '1~10', '21~30', '21~28'], dtype=object))

In [21]:
date_range = {'1~10': 0, '11~20': 1, '21~28': 2, '21~29': 2, '21~30': 2, '21~31': 2}

train_df.replace({"transaction_date": date_range}, inplace=True)
test_df.replace({"transaction_date": date_range}, inplace=True)

train_df.head()

,transaction_id,apartment_id,city,exclusive_use_area,year_of_completion,transaction_year_month,transaction_date,floor,transaction_real_price,hanriver,dong_rank,apt_rank,jibun_rank
0,0,7622,0,84.82,2002,200801,3,2,37500,0,233,3156,2335
1,50,12536,0,106.81,2006,200802,1,13,64000,0,321,3935,3315
2,100,3926,0,40.07,2005,200803,1,10,19000,0,132,2066,1182
3,150,7094,0,59.74,2000,200803,3,2,18000,0,174,1227,1111
4,200,10147,0,106.62,1993,200804,1,5,43500,0,206,2731,2469

In [22]:
train_df.info(), test_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24320 entries, 0 to 24319
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   transaction_id          24320 non-null  int64
 1   apartment_id            24320 non-null  int64
 2   city                    24320 non-null  int64
 3   exclusive_use_area      24320 non-null  float64
 4   year_of_completion      24320 non-null  int64
 5   transaction_year_month  24320 non-null  int64
 6   transaction_date        24320 non-null  int64
 7   floor                   24320 non-null  int64
 8   transaction_real_price  24320 non-null  int64
 9   hanriver                24320 non-null  int64
 10  dong_rank               24320 non-null  int64
 11  apt_rank                24320 non-null  int64
 12  jibun_rank              24320 non-null  int64
dtypes: float64(1), int64(12)
memory usage: 2.4 MB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5463 entries, 0 to 5462
Data columns (total 12 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   transaction_id          5463 non-null   int64
 1   apartment_id            5463 non-null   int64
 2   city                    5463 non-null   int64
 3   exclusive_use_area      5463 non-null   float64
 4   year_of_completion      5463 non-null   int64
 5   transaction_year_month  5463 non-null   int64
 6   transaction_date        5463 non-null   int64
 7   floor                   5463 non-null   int64
 8   hanriver                5463 non-null   int64
 9   dong_rank               5441 non-null   float64
 10  apt_rank                4032 non-null   float64
 11  jibun_rank              4265 non-null   float64
dtypes: float64(4), int64(8)
memory usage: 512.3 KB

(None, None)

## test_df null 값 처리

In [23]:
test_df["dong_rank"].fillna(test_df["dong_rank"].mean(), inplace=True)
test_df["apt_rank"].fillna(test_df["apt_rank"].mean(), inplace=True)
test_df["jibun_rank"].fillna(test_df["jibun_rank"].mean(), inplace=True)

## 데이터셋 분리

In [24]:
from sklearn.model_selection import train_test_split

x = train_df.drop("transaction_real_price", axis=1)
y = train_df["transaction_real_price"]

x_train, x_valid, y_train, y_valid = train_test_split(x, y, test_size=0.3, random_state=42)

print(x_train.shape, x_valid.shape)
print(y_train.shape, y_valid.shape)

(17024, 12) (7296, 12)
(17024,) (7296,)

## 모델 학습 및 예측

### SVM

In [25]:
from sklearn.svm import SVC

svc = SVC()
svc.fit(x_train, y_train)

y_hat = svc.predict(x_valid)

In [26]:
from sklearn.metrics import mean_squared_error

svm_rmse = mean_squared_error(y_valid, y_hat)**0.5
svm_rmse

30975.877455535472

In [27]:
y_test = pd.Series(svc.predict(test_df))

In [30]:
svm_submission = pd.concat([test_df['transaction_id'], y_test], axis=1)

svm_submission.columns = ['transaction_id', 'transaction_real_price']
svm_submission.to_csv('svm_50_submission.csv', header = True, index = False)

In [31]:
test = pd.read_csv('svm_50_submission.csv')
test

      transaction_id  transaction_real_price
0            1145756                   20000
1            1198704                   20000
2            1222384                   20000
3            1179897                   20000
4            1223091                   20000
...              ...                     ...
5458         1174640                   20000
5459         1175575                   20000
5460         1157024                   20000
5461         1136863                   20000
5462         1218921                   20000

[5463 rows x 2 columns]

In [32]:
test.transaction_real_price.unique()

array([20000])

### RandomForest

In [33]:
from sklearn.ensemble import RandomForestRegressor

rf = RandomForestRegressor(max_depth=5, random_state=42)
rf.fit(x_train, y_train)


y_hat = rf.predict(x_valid)

In [34]:
rf_rmse = mean_squared_error(y_valid, y_hat)**0.5
rf_rmse

10864.743309020218

In [35]:
y_test = pd.Series(rf.predict(test_df))

In [36]:
rf_submission = pd.concat([test_df['transaction_id'], y_test], axis=1)


rf_submission.columns = ['transaction_id', 'transaction_real_price']
rf_submission.to_csv('rf_50_submission.csv', header = True, index = False)

In [37]:
test = pd.read_csv('rf_50_submission.csv')
test

      transaction_id  transaction_real_price
0            1145756            38736.105774
1            1198704             9958.430493
2            1222384             8100.683599
3            1179897            56360.539055
4            1223091            38552.175777
...              ...                     ...
5458         1174640            48886.623397
5459         1175575           164432.239023
5460         1157024            58855.867291
5461         1136863            38333.015562
5462         1218921             9958.430493

[5463 rows x 2 columns]

In [39]:
len(test["transaction_real_price"].unique())

2145